{
  "session_id": "20241212_143022",
  "transcript": "Welcome to our Q2 planning meeting. Let's discuss the quarterly goals and targets for the upcoming quarter. We need to increase sales by 25% this quarter to meet our annual targets. John will prepare the budget proposal by Friday and submit it to the finance team. Sarah agreed to review the marketing campaign and provide feedback by next Tuesday. We decided to launch the new product in March 2025 to capitalize on the spring market. The team must submit progress reports by the 15th of each month. We should focus on customer retention and improve our support response time to under 2 hours. Mike will coordinate with the development team to ensure the new features are ready by February 28th. The marketing budget has been approved for $50,000 and should be allocated by the end of this week. We need to schedule follow-up meetings every two weeks to track progress. The quarterly review will be held on March 31st, 2025. Meeting adjourned. Thank you everyone for your participation.",
  "minutes": "Meeting Minutes - December 12, 2024\n\n📋 Summary (200 words):\nWelcome to our Q2 planning meeting. Let's discuss the quarterly goals and targets for the upcoming quarter. We need to increase sales by 25% this quarter to meet our annual targets. John will prepare the budget proposal by Friday and submit it to the finance team. Sarah agreed to review the marketing campaign and provide feedback by next Tuesday. We decided to launch the new product in March 2025 to capitalize on the spring market. The team must submit progress reports by the 15th of each month. We should focus on customer retention and improve our support response time to under 2 hours. Mike will coordinate with the development team to ensure the new features are ready by February 28th. The marketing budget has been approved for $50,000 and should be allocated by the end of this week. We need to schedule follow-up meetings every two weeks to track progress. The quarterly review will be held on March 31st, 2025. Meeting adjourned. Thank you everyone for your participation.\n\n✅ Action Items (6 found):\n1. We need to increase sales by 25% this quarter to meet our annual targets\n2. John will prepare the budget proposal by Friday and submit it to the finance team\n3. The team must submit progress reports by the 15th of each month\n4. We should focus on customer retention and improve our support response time to under 2 hours\n5. Mike will coordinate with the development team to ensure the new features are ready by February 28th\n6. We need to schedule follow-up meetings every two weeks to track progress\n\n📅 Dates Mentioned (4 found):\n1. Friday\n2. next Tuesday\n3. March 2025\n4. February 28th\n\n🔍 Key Topics:\n• Meeting duration: 12 main discussion points\n• Transcript chunks: 1 segments processed\n• Focus areas: Welcome to our Q2 planning meeting, Let's discuss the quarterly goals and targets for the upcoming quarter, We need to increase sales by 25% this quarter to meet our annual targets\n• Next steps: Review action items and set deadlines",
  "start_time": "2024-12-12T14:30:22",
  "completion_time": "2024-12-12T14:32:15"
} 